enjoygeek/EFM32/EFM32GG280/rf/inc/si446x_defs.h
#define SI446X_PROP_GRP_INDEX_OTP_VARS_SPI_ACTIVE_SEQ_DELAY_15_8               0
#define SI446X_PROP_GRP_INDEX_OTP_VARS_SPI_ACTIVE_SEQ_DELAY_7_0                1
#define SI446X_PROP_GRP_INDEX_OTP_VARS_TX_TUNE_SEQ_DELAY                       2
#define SI446X_PROP_GRP_INDEX_OTP_VARS_READY_SEQ_DELAY                         3
#define SI446X_PROP_GRP_INDEX_OTP_VARS_RX_SEQ_DELAY_15_8                       4
#define SI446X_PROP_GRP_INDEX_OTP_VARS_RX_SEQ_DELAY_7_0                        5
#define SI446X_PROP_GRP_INDEX_OTP_VARS_CAL_ENABLE_VTR                          6
#define SI446X_PROP_GRP_INDEX_OTP_VARS_CAL_ENABLE                              7
#define SI446X_PROP_GRP_INDEX_OTP_VARS_VTR_VCO_V3P3_TARGET_VOLTAGE             8
#define SI446X_PROP_GRP_INDEX_OTP_VARS_VTR_VCO_V1P5_TARGET_VOLTAGE             9
#define SI446X_PROP_GRP_INDEX_OTP_VARS_VTR_VCO_LADR_TARGET_VOLTAGE             10
#define SI446X_PROP_GRP_INDEX_OTP_VARS_RC_CAL_ADC_TARGET_15_8                  11
#define SI446X_PROP_GRP_INDEX_OTP_VARS_RC_CAL_ADC_TARGET_7_0                   12
#define SI446X_PROP_GRP_INDEX_OTP_VARS_RC_CAL                                  13
#define SI446X_PROP_GRP_INDEX_OTP_VARS_RC_CAL1                                 14
#define SI446X_PROP_GRP_INDEX_OTP_VARS_RC_CAL2                                 15
#define SI446X_PROP_GRP_INDEX_OTP_VARS_BOOT_OSC_CAL                            16
#define SI446X_PROP_GRP_INDEX_OTP_VARS_BOOT_OSC_CAL1                           17
#define SI446X_PROP_GRP_INDEX_OTP_VARS_AUXADC_TEMP_SLOPE                       18
#define SI446X_PROP_GRP_INDEX_OTP_VARS_AUXADC_TEMP_INTERCEPT                   19
#define SI446X_PROP_GRP_INDEX_OTP_VARS_AUXADC_SY_GAIN_ERROR                    20
#define SI446X_PROP_GRP_INDEX_OTP_VARS_AUXADC_SY_OFFSET_ERROR                  21
#define SI446X_PROP_GRP_INDEX_OTP_VARS_ADC_VOLTAGE_TRIM                        22
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_RXFE_LPF                            23
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_ADC_LPF                             24
#define SI446X_PROP_GRP_INDEX_OTP_VARS_VCO_LOAD5_LPF                           25
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_CLKGEN_COM_LPF                      26
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_FBDIV_COM_LPF                       27
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_CLKGEN_TX_LPF                       28
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_FBDIV_TX_LPF                        29
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_CLKGEN_COM_LOW_BAND                 30
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_RXFE_HPF                            31
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_ADC_HPF                             32
#define SI446X_PROP_GRP_INDEX_OTP_VARS_VCO_LOAD5_HPF                           33
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_CLKGEN_COM_HPF                      34
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_FBDIV_COM_HPF                       35
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_CLKGEN_TX_HPF                       36
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REG_FBDIV_TX_HPF                        37
#define SI446X_PROP_GRP_INDEX_OTP_VARS_PH_WATERMARK                            38
#define SI446X_PROP_GRP_INDEX_OTP_VARS_PROC_MON_RCAL                           39
#define SI446X_PROP_GRP_INDEX_OTP_VARS_REF_CAL_BANDGAP                         40
#define SI446X_PROP_GRP_INDEX_OTP_VARS_VCO_ADJ                                 41
#define SI446X_PROP_GRP_INDEX_OTP_VARS_MISC_DELAY                              42
#define SI446X_PROP_GRP_INDEX_OTP_VARS_SPARE0                                  43
#define SI446X_PROP_GRP_INDEX_OTP_VARS_SPARE1                                  44

#define SI446X_PROP_GRP_INDEX_PKT_CRC_CONFIG                                   0
#define SI446X_PROP_GRP_INDEX_PKT_WHT_POLY_15_8                                1
#define SI446X_PROP_GRP_INDEX_PKT_WHT_POLY_7_0                                 2
#define SI446X_PROP_GRP_INDEX_PKT_WHT_SEED_15_8                                3
#define SI446X_PROP_GRP_INDEX_PKT_WHT_SEED_7_0                                 4
#define SI446X_PROP_GRP_INDEX_PKT_WHT_BIT_NUM                                  5
#define SI446X_PROP_GRP_INDEX_PKT_CONFIG1                                      6
#define SI446X_PROP_GRP_INDEX_PKT_RESERVED_18_7                                7
#define SI446X_PROP_GRP_INDEX_PKT_LEN                                          8
#define SI446X_PROP_GRP_INDEX_PKT_LEN_FIELD_SOURCE                             9
#define SI446X_PROP_GRP_INDEX_PKT_LEN_ADJUST                                   10
#define SI446X_PROP_GRP_INDEX_PKT_TX_THRESHOLD                                 11
#define SI446X_PROP_GRP_INDEX_PKT_RX_THRESHOLD                                 12
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_1_LENGTH_12_8                          13
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_1_LENGTH_7_0                           14
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_1_CONFIG                               15
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_1_CRC_CONFIG                           16
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_2_LENGTH_12_8                          17
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_2_LENGTH_7_0                           18
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_2_CONFIG                               19
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_2_CRC_CONFIG                           20
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_3_LENGTH_12_8                          21
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_3_LENGTH_7_0                           22
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_3_CONFIG                               23
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_3_CRC_CONFIG                           24
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_4_LENGTH_12_8                          25
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_4_LENGTH_7_0                           26
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_4_CONFIG                               27
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_4_CRC_CONFIG                           28
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_5_LENGTH_12_8                          29
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_5_LENGTH_7_0                           30
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_5_CONFIG                               31
#define SI446X_PROP_GRP_INDEX_PKT_FIELD_5_CRC_CONFIG                           32
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_1_LENGTH_12_8                       33
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_1_LENGTH_7_0                        34
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_1_CONFIG                            35
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_1_CRC_CONFIG                        36
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_2_LENGTH_12_8                       37
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_2_LENGTH_7_0                        38
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_2_CONFIG                            39
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_2_CRC_CONFIG                        40
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_3_LENGTH_12_8                       41
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_3_LENGTH_7_0                        42
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_3_CONFIG                            43
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_3_CRC_CONFIG                        44
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_4_LENGTH_12_8                       45
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_4_LENGTH_7_0                        46
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_4_CONFIG                            47
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_4_CRC_CONFIG                        48
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_5_LENGTH_12_8                       49
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_5_LENGTH_7_0                        50
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_5_CONFIG                            51
#define SI446X_PROP_GRP_INDEX_PKT_RX_FIELD_5_CRC_CONFIG                        52

#define SI446X_PROP_GRP_INDEX_PREAMBLE_TX_LENGTH                               0
#define SI446X_PROP_GRP_INDEX_PREAMBLE_CONFIG_STD_1                            1
#define SI446X_PROP_GRP_INDEX_PREAMBLE_CONFIG_NSTD                             2
#define SI446X_PROP_GRP_INDEX_PREAMBLE_CONFIG_STD_2                            3
#define SI446X_PROP_GRP_INDEX_PREAMBLE_CONFIG                                  4
#define SI446X_PROP_GRP_INDEX_PREAMBLE_PATTERN_31_24                           5
#define SI446X_PROP_GRP_INDEX_PREAMBLE_PATTERN_23_16                           6
#define SI446X_PROP_GRP_INDEX_PREAMBLE_PATTERN_15_8                            7
#define SI446X_PROP_GRP_INDEX_PREAMBLE_PATTERN_7_0                             8
#define SI446X_PROP_GRP_INDEX_PREAMBLE_POSTAMBLE_CONFIG                        9
#define SI446X_PROP_GRP_INDEX_PREAMBLE_POSTAMBLE_PATTERN_31_24                 10
#define SI446X_PROP_GRP_INDEX_PREAMBLE_POSTAMBLE_PATTERN_23_16                 11
#define SI446X_PROP_GRP_INDEX_PREAMBLE_POSTAMBLE_PATTERN_15_8                  12
#define SI446X_PROP_GRP_INDEX_PREAMBLE_POSTAMBLE_PATTERN_7_0                   13

#define SI446X_PROP_GRP_INDEX_GLOBAL_XO_TUNE                                   0
#define SI446X_PROP_GRP_INDEX_GLOBAL_CLK_CFG                                   1
#define SI446X_PROP_GRP_INDEX_GLOBAL_LOW_BATT_THRESH                           2
#define SI446X_PROP_GRP_INDEX_GLOBAL_CONFIG                                    3
#define SI446X_PROP_GRP_INDEX_GLOBAL_WUT_CONFIG                                4
#define SI446X_PROP_GRP_INDEX_GLOBAL_WUT_M_15_8                                5
#define SI446X_PROP_GRP_INDEX_GLOBAL_WUT_M_7_0                                 6
#define SI446X_PROP_GRP_INDEX_GLOBAL_WUT_R                                     7
#define SI446X_PROP_GRP_INDEX_GLOBAL_WUT_LDC                                   8
#define SI446X_PROP_GRP_INDEX_GLOBAL_WUT_CAL                                   9

#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE13_7_0                  0
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE12_7_0                  1
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE11_7_0                  2
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE10_7_0                  3
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE9_7_0                   4
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE8_7_0                   5
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE7_7_0                   6
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE6_7_0                   7
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE5_7_0                   8
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE4_7_0                   9
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE3_7_0                   10
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE2_7_0                   11
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE1_7_0                   12
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COE0_7_0                   13
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COEM0                      14
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COEM1                      15
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COEM2                      16
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX1_CHFLT_COEM3                      17
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE13_7_0                  18
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE12_7_0                  19
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE11_7_0                  20
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE10_7_0                  21
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE9_7_0                   22
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE8_7_0                   23
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE7_7_0                   24
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE6_7_0                   25
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE5_7_0                   26
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE4_7_0                   27
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE3_7_0                   28
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE2_7_0                   29
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE1_7_0                   30
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COE0_7_0                   31
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COEM0                      32
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COEM1                      33
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COEM2                      34
#define SI446X_PROP_GRP_INDEX_MODEM_CHFLT_RX2_CHFLT_COEM3                      35

#define SI446X_PROP_GRP_INDEX_MATCH_VALUE_1                                    0
#define SI446X_PROP_GRP_INDEX_MATCH_MASK_1                                     1
#define SI446X_PROP_GRP_INDEX_MATCH_CTRL_1                                     2
#define SI446X_PROP_GRP_INDEX_MATCH_VALUE_2                                    3
#define SI446X_PROP_GRP_INDEX_MATCH_MASK_2                                     4
#define SI446X_PROP_GRP_INDEX_MATCH_CTRL_2                                     5
#define SI446X_PROP_GRP_INDEX_MATCH_VALUE_3                                    6
#define SI446X_PROP_GRP_INDEX_MATCH_MASK_3                                     7
#define SI446X_PROP_GRP_INDEX_MATCH_CTRL_3                                     8
#define SI446X_PROP_GRP_INDEX_MATCH_VALUE_4                                    9
#define SI446X_PROP_GRP_INDEX_MATCH_MASK_4                                     10
#define SI446X_PROP_GRP_INDEX_MATCH_CTRL_4                                     11

#define SI446X_PROP_GRP_INDEX_SYNTH_PFDCP_CPFF                                 0
#define SI446X_PROP_GRP_INDEX_SYNTH_PFDCP_CPINT                                1
#define SI446X_PROP_GRP_INDEX_SYNTH_VCO_KV                                     2
#define SI446X_PROP_GRP_INDEX_SYNTH_LPFILT3                                    3
#define SI446X_PROP_GRP_INDEX_SYNTH_LPFILT2                                    4
#define SI446X_PROP_GRP_INDEX_SYNTH_LPFILT1                                    5
#define SI446X_PROP_GRP_INDEX_SYNTH_LPFILT0                                    6
#define SI446X_PROP_GRP_INDEX_SYNTH_VCO_KVCAL                                  7

#define SI446X_PROP_GRP_INDEX_FREQ_CONTROL_INTE                                0
#define SI446X_PROP_GRP_INDEX_FREQ_CONTROL_FRAC_2                              1
#define SI446X_PROP_GRP_INDEX_FREQ_CONTROL_FRAC_1                              2
#define SI446X_PROP_GRP_INDEX_FREQ_CONTROL_FRAC_0                              3
#define SI446X_PROP_GRP_INDEX_FREQ_CONTROL_CHANNEL_STEP_SIZE_1                 4
#define SI446X_PROP_GRP_INDEX_FREQ_CONTROL_CHANNEL_STEP_SIZE_0                 5
#define SI446X_PROP_GRP_INDEX_FREQ_CONTROL_W_SIZE                              6
#define SI446X_PROP_GRP_INDEX_FREQ_CONTROL_VCOCNT_RX_ADJ                       7

// Defines for fields within the properties.
#define SI446X_PROP_GLOBAL_XO_TUNE_MASK                                        0xFF
#define SI446X_PROP_GLOBAL_XO_TUNE_DEFAULT                                     0x40
#define SI446X_PROP_GLOBAL_XO_TUNE_TUNE_VALUE_SIZE                             7
#define SI446X_PROP_GLOBAL_XO_TUNE_TUNE_VALUE_LSB                              0
#define SI446X_PROP_GLOBAL_XO_TUNE_TUNE_VALUE_MSB                              6
#define SI446X_PROP_GLOBAL_XO_TUNE_TUNE_VALUE_MASK                             0x7F
#define SI446X_PROP_GLOBAL_XO_TUNE_TUNE_VALUE_ENUM_FASTEST_FREQUENCY           0
#define SI446X_PROP_GLOBAL_XO_TUNE_TUNE_VALUE_ENUM_SLOWEST_FREQUENCY           127

#define SI446X_PROP_GLOBAL_CLK_CFG_MASK                                        0xFF
#define SI446X_PROP_GLOBAL_CLK_CFG_DEFAULT                                     0
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_EN_SIZE                         1
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_EN_LSB                          6
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_EN_MSB                          6
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_EN_MASK                         0x40
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_EN_BIT                          0x40
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_EN_ENUM_DISABLE                 0
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_EN_ENUM_ENABLE                  1
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_SIZE                        3
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_LSB                         3
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_MSB                         5
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_MASK                        0x38
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_ENUM_DIV_1                  0
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_ENUM_DIV_2                  1
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_ENUM_DIV_3                  2
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_ENUM_DIV_7_5                3
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_ENUM_DIV_10                 4
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_ENUM_DIV_15                 5
#define SI446X_PROP_GLOBAL_CLK_CFG_DIVIDED_CLK_SEL_ENUM_DIV_30                 6
#define SI446X_PROP_GLOBAL_CLK_CFG_CLK_32K_SEL_SIZE                            3
#define SI446X_PROP_GLOBAL_CLK_CFG_CLK_32K_SEL_LSB                             0
#define SI446X_PROP_GLOBAL_CLK_CFG_CLK_32K_SEL_MSB                             2
#define SI446X_PROP_GLOBAL_CLK_CFG_CLK_32K_SEL_MASK                            0x7
#define SI446X_PROP_GLOBAL_CLK_CFG_CLK_32K_SEL_ENUM_OFF                        0
#define SI446X_PROP_GLOBAL_CLK_CFG_CLK_32K_SEL_ENUM_RC                         1
#define SI446X_PROP_GLOBAL_CLK_CFG_CLK_32K_SEL_ENUM_CRYSTAL                    2

#define SI446X_PROP_GLOBAL_LOW_BATT_THRESH_MASK                                0xFF
#define SI446X_PROP_GLOBAL_LOW_BATT_THRESH_DEFAULT                             0x18
#define SI446X_PROP_GLOBAL_LOW_BATT_THRESH_THRESHOLD_SIZE                      5
#define SI446X_PROP_GLOBAL_LOW_BATT_THRESH_THRESHOLD_LSB                       0
#define SI446X_PROP_GLOBAL_LOW_BATT_THRESH_THRESHOLD_MSB                       4
#define SI446X_PROP_GLOBAL_LOW_BATT_THRESH_THRESHOLD_MIN                       0
#define SI446X_PROP_GLOBAL_LOW_BATT_THRESH_THRESHOLD_MAX                       31
#define SI446X_PROP_GLOBAL_LOW_BATT_THRESH_THRESHOLD_MASK                      0x1F
#define SI446X_PROP_GLOBAL_LOW_BATT_THRESH_THRESHOLD_ENUM_HIGH_POWER           0
#define SI446X_PROP_GLOBAL_LOW_BATT_THRESH_THRESHOLD_ENUM_LOW_POWER            31

