enjoygeek/EFM32/EFM32GG280/rf/inc/si446x_defs.h
#define SI446X_PROP_GLOBAL_CONFIG_MASK                                         0xFF
#define SI446X_PROP_GLOBAL_CONFIG_DEFAULT                                      0x20
#define SI446X_PROP_GLOBAL_CONFIG_LPF_SATURATION_MODE_SIZE                     1
#define SI446X_PROP_GLOBAL_CONFIG_LPF_SATURATION_MODE_LSB                      6
#define SI446X_PROP_GLOBAL_CONFIG_LPF_SATURATION_MODE_MSB                      6
#define SI446X_PROP_GLOBAL_CONFIG_LPF_SATURATION_MODE_MASK                     0x40
#define SI446X_PROP_GLOBAL_CONFIG_LPF_SATURATION_MODE_BIT                      0x40
#define SI446X_PROP_GLOBAL_CONFIG_LPF_SATURATION_MODE_ENUM_HIGH_SAT            0
#define SI446X_PROP_GLOBAL_CONFIG_LPF_SATURATION_MODE_ENUM_LOW_SAT             1
#define SI446X_PROP_GLOBAL_CONFIG_SEQUENCER_MODE_SIZE                          1
#define SI446X_PROP_GLOBAL_CONFIG_SEQUENCER_MODE_LSB                           5
#define SI446X_PROP_GLOBAL_CONFIG_SEQUENCER_MODE_MSB                           5
#define SI446X_PROP_GLOBAL_CONFIG_SEQUENCER_MODE_MASK                          0x20
#define SI446X_PROP_GLOBAL_CONFIG_SEQUENCER_MODE_BIT                           0x20
#define SI446X_PROP_GLOBAL_CONFIG_SEQUENCER_MODE_ENUM_GUARANTEED               0
#define SI446X_PROP_GLOBAL_CONFIG_SEQUENCER_MODE_ENUM_FAST                     1
#define SI446X_PROP_GLOBAL_CONFIG_FIFO_MODE_SIZE                               1
#define SI446X_PROP_GLOBAL_CONFIG_FIFO_MODE_LSB                                4
#define SI446X_PROP_GLOBAL_CONFIG_FIFO_MODE_MSB                                4
#define SI446X_PROP_GLOBAL_CONFIG_FIFO_MODE_MASK                               0x10
#define SI446X_PROP_GLOBAL_CONFIG_FIFO_MODE_BIT                                0x10
#define SI446X_PROP_GLOBAL_CONFIG_FIFO_MODE_ENUM_SPLIT_FIFO                    0
#define SI446X_PROP_GLOBAL_CONFIG_FIFO_MODE_ENUM_HALF_DUPLEX_FIFO              1
#define SI446X_PROP_GLOBAL_CONFIG_PROTOCOL_SIZE                                3
#define SI446X_PROP_GLOBAL_CONFIG_PROTOCOL_LSB                                 1
#define SI446X_PROP_GLOBAL_CONFIG_PROTOCOL_MSB                                 3
#define SI446X_PROP_GLOBAL_CONFIG_PROTOCOL_MASK                                0xE
#define SI446X_PROP_GLOBAL_CONFIG_POWER_MODE_SIZE                              1
#define SI446X_PROP_GLOBAL_CONFIG_POWER_MODE_LSB                               0
#define SI446X_PROP_GLOBAL_CONFIG_POWER_MODE_MSB                               0
#define SI446X_PROP_GLOBAL_CONFIG_POWER_MODE_MASK                              0x1
#define SI446X_PROP_GLOBAL_CONFIG_POWER_MODE_BIT                               0x1
#define SI446X_PROP_GLOBAL_CONFIG_POWER_MODE_ENUM_HIGH_POWER                   0
#define SI446X_PROP_GLOBAL_CONFIG_POWER_MODE_ENUM_LOW_POWER                    1

#define SI446X_PROP_GLOBAL_WUT_CONFIG_MASK                                     0xFF
#define SI446X_PROP_GLOBAL_WUT_CONFIG_DEFAULT                                  0x00
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LDC_EN_SIZE                          2
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LDC_EN_LSB                           6
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LDC_EN_MSB                           7
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LDC_EN_MASK                          0xC0
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LDC_EN_ENUM_DISABLE_LDC              0
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LDC_EN_ENUM_RX_LDC                   1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LDC_EN_ENUM_TX_LDC                   2
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_SIZE                      3
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_LSB                       3
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_MSB                       5
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_MASK                      0x38
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_ENUM_1_SEC                0
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_ENUM_2_SEC                1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_ENUM_4_SEC                2
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_ENUM_8_SEC                3
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_ENUM_16_SEC               4
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_ENUM_32_SEC               5
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_ENUM_64_SEC               6
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_CAL_PERIOD_ENUM_128_SEC              7
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LBD_EN_SIZE                          1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LBD_EN_LSB                           2
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LBD_EN_MSB                           2
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LBD_EN_MASK                          0x4
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LBD_EN_BIT                           0x4
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LBD_EN_ENUM_DISABLE_LBD              0
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_LBD_EN_ENUM_ENABLE_LBD               1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_EN_SIZE                              1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_EN_LSB                               1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_EN_MSB                               1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_EN_MASK                              0x2
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_EN_BIT                               0x2
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_EN_ENUM_DISABLE_WUT                  0
#define SI446X_PROP_GLOBAL_WUT_CONFIG_WUT_EN_ENUM_ENABLE_WUT                   1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_CAL_EN_SIZE                              1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_CAL_EN_LSB                               0
#define SI446X_PROP_GLOBAL_WUT_CONFIG_CAL_EN_MSB                               0
#define SI446X_PROP_GLOBAL_WUT_CONFIG_CAL_EN_MASK                              0x1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_CAL_EN_BIT                               0x1
#define SI446X_PROP_GLOBAL_WUT_CONFIG_CAL_EN_ENUM_DISABLE_CAL                  0
#define SI446X_PROP_GLOBAL_WUT_CONFIG_CAL_EN_ENUM_ENABLE_CAL                   1

#define SI446X_PROP_GLOBAL_WUT_M_15_8_MASK                                     0xFF
#define SI446X_PROP_GLOBAL_WUT_M_15_8_DEFAULT                                  0x00
#define SI446X_PROP_GLOBAL_WUT_M_15_8_WUT_M_15_8_SIZE                          8
#define SI446X_PROP_GLOBAL_WUT_M_15_8_WUT_M_15_8_LSB                           0
#define SI446X_PROP_GLOBAL_WUT_M_15_8_WUT_M_15_8_MSB                           7
#define SI446X_PROP_GLOBAL_WUT_M_15_8_WUT_M_15_8_MIN                           0
#define SI446X_PROP_GLOBAL_WUT_M_15_8_WUT_M_15_8_MAX                           255
#define SI446X_PROP_GLOBAL_WUT_M_15_8_WUT_M_15_8_MASK                          0xFF

#define SI446X_PROP_GLOBAL_WUT_M_7_0_MASK                                      0xFF
#define SI446X_PROP_GLOBAL_WUT_M_7_0_DEFAULT                                   0x01
#define SI446X_PROP_GLOBAL_WUT_M_7_0_WUT_M_7_0_SIZE                            8
#define SI446X_PROP_GLOBAL_WUT_M_7_0_WUT_M_7_0_LSB                             0
#define SI446X_PROP_GLOBAL_WUT_M_7_0_WUT_M_7_0_MSB                             7
#define SI446X_PROP_GLOBAL_WUT_M_7_0_WUT_M_7_0_MIN                             1
#define SI446X_PROP_GLOBAL_WUT_M_7_0_WUT_M_7_0_MAX                             255
#define SI446X_PROP_GLOBAL_WUT_M_7_0_WUT_M_7_0_MASK                            0xFF

#define SI446X_PROP_GLOBAL_WUT_R_MASK                                          0xFF
#define SI446X_PROP_GLOBAL_WUT_R_DEFAULT                                       0x60
#define SI446X_PROP_GLOBAL_WUT_R_WUT_SLEEP_SIZE                                1
#define SI446X_PROP_GLOBAL_WUT_R_WUT_SLEEP_LSB                                 5
#define SI446X_PROP_GLOBAL_WUT_R_WUT_SLEEP_MSB                                 5
#define SI446X_PROP_GLOBAL_WUT_R_WUT_SLEEP_MASK                                0x20
#define SI446X_PROP_GLOBAL_WUT_R_WUT_SLEEP_BIT                                 0x20
#define SI446X_PROP_GLOBAL_WUT_R_WUT_SLEEP_ENUM_READY                          0
#define SI446X_PROP_GLOBAL_WUT_R_WUT_SLEEP_ENUM_SLEEP                          1
#define SI446X_PROP_GLOBAL_WUT_R_WUT_R_SIZE                                    5
#define SI446X_PROP_GLOBAL_WUT_R_WUT_R_LSB                                     0
#define SI446X_PROP_GLOBAL_WUT_R_WUT_R_MSB                                     4
#define SI446X_PROP_GLOBAL_WUT_R_WUT_R_MIN                                     0
#define SI446X_PROP_GLOBAL_WUT_R_WUT_R_MAX                                     20
#define SI446X_PROP_GLOBAL_WUT_R_WUT_R_MASK                                    0x1F

