enjoygeek/EFM32/EFM32GG280/rf/inc/si446x_defs.h
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_2_MASK                                  0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_2_DEFAULT                               2
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_2_CHANNEL_NUM_SIZE                      8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_2_CHANNEL_NUM_LSB                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_2_CHANNEL_NUM_MSB                       7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_2_CHANNEL_NUM_MIN                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_2_CHANNEL_NUM_MAX                       255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_2_CHANNEL_NUM_MASK                      0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_2_CHANNEL_NUM_ENUM_INVALID              255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_3_MASK                                  0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_3_DEFAULT                               3
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_3_CHANNEL_NUM_SIZE                      8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_3_CHANNEL_NUM_LSB                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_3_CHANNEL_NUM_MSB                       7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_3_CHANNEL_NUM_MIN                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_3_CHANNEL_NUM_MAX                       255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_3_CHANNEL_NUM_MASK                      0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_3_CHANNEL_NUM_ENUM_INVALID              255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_4_MASK                                  0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_4_DEFAULT                               4
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_4_CHANNEL_NUM_SIZE                      8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_4_CHANNEL_NUM_LSB                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_4_CHANNEL_NUM_MSB                       7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_4_CHANNEL_NUM_MIN                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_4_CHANNEL_NUM_MAX                       255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_4_CHANNEL_NUM_MASK                      0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_4_CHANNEL_NUM_ENUM_INVALID              255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_5_MASK                                  0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_5_DEFAULT                               5
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_5_CHANNEL_NUM_SIZE                      8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_5_CHANNEL_NUM_LSB                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_5_CHANNEL_NUM_MSB                       7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_5_CHANNEL_NUM_MIN                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_5_CHANNEL_NUM_MAX                       255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_5_CHANNEL_NUM_MASK                      0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_5_CHANNEL_NUM_ENUM_INVALID              255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_6_MASK                                  0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_6_DEFAULT                               6
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_6_CHANNEL_NUM_SIZE                      8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_6_CHANNEL_NUM_LSB                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_6_CHANNEL_NUM_MSB                       7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_6_CHANNEL_NUM_MIN                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_6_CHANNEL_NUM_MAX                       255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_6_CHANNEL_NUM_MASK                      0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_6_CHANNEL_NUM_ENUM_INVALID              255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_7_MASK                                  0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_7_DEFAULT                               7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_7_CHANNEL_NUM_SIZE                      8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_7_CHANNEL_NUM_LSB                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_7_CHANNEL_NUM_MSB                       7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_7_CHANNEL_NUM_MIN                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_7_CHANNEL_NUM_MAX                       255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_7_CHANNEL_NUM_MASK                      0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_7_CHANNEL_NUM_ENUM_INVALID              255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_8_MASK                                  0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_8_DEFAULT                               8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_8_CHANNEL_NUM_SIZE                      8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_8_CHANNEL_NUM_LSB                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_8_CHANNEL_NUM_MSB                       7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_8_CHANNEL_NUM_MIN                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_8_CHANNEL_NUM_MAX                       255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_8_CHANNEL_NUM_MASK                      0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_8_CHANNEL_NUM_ENUM_INVALID              255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_9_MASK                                  0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_9_DEFAULT                               9
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_9_CHANNEL_NUM_SIZE                      8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_9_CHANNEL_NUM_LSB                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_9_CHANNEL_NUM_MSB                       7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_9_CHANNEL_NUM_MIN                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_9_CHANNEL_NUM_MAX                       255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_9_CHANNEL_NUM_MASK                      0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_9_CHANNEL_NUM_ENUM_INVALID              255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_10_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_10_DEFAULT                              10
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_10_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_10_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_10_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_10_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_10_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_10_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_10_CHANNEL_NUM_ENUM_INVALID             255

