enjoygeek/EFM32/EFM32GG280/rf/inc/si446x_defs.h
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_23_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_23_DEFAULT                              23
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_23_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_23_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_23_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_23_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_23_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_23_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_23_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_24_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_24_DEFAULT                              24
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_24_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_24_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_24_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_24_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_24_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_24_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_24_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_25_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_25_DEFAULT                              25
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_25_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_25_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_25_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_25_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_25_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_25_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_25_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_26_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_26_DEFAULT                              26
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_26_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_26_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_26_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_26_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_26_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_26_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_26_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_27_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_27_DEFAULT                              27
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_27_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_27_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_27_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_27_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_27_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_27_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_27_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_28_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_28_DEFAULT                              28
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_28_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_28_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_28_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_28_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_28_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_28_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_28_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_29_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_29_DEFAULT                              29
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_29_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_29_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_29_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_29_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_29_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_29_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_29_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_30_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_30_DEFAULT                              30
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_30_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_30_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_30_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_30_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_30_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_30_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_30_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_DEFAULT                              31
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_31_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_DEFAULT                              32
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_32_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_DEFAULT                              33
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_33_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_DEFAULT                              34
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_34_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_DEFAULT                              35
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_35_CHANNEL_NUM_ENUM_INVALID             255

